Тестовая_база_ERP_14/src/InformationRegisters/СинхронизацияКлассификаторовВЕТИС/СинхронизацияКлассификаторовВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинхронизацияКлассификаторовВЕТИС</name>
  <resources>
    <name>ДатаСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Смещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипВЕТИС</name>
    <type>
      <types>EnumRef.ТипыВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/Enums/ТипыВЕТИС/ТипыВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыВЕТИС</name>
  <enumValues>
    <name>ХозяйствующиеСубъекты</name>
  </enumValues>
  <enumValues>
    <name>ПредприятияРФ</name>
  </enumValues>
  <enumValues>
    <name>ЗарубежныеПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ВидыПродукции</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>НаименованияПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>НазначенияГрузов</name>
  </enumValues>
  <enumValues>
    <name>ВетеринарноСопроводительныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ЗаписиСкладскогоЖурнала</name>
  </enumValues>
  <enumValues>
    <name>Упаковки</name>
  </enumValues>
  <enumValues>
    <name>СтраныМира</name>
  </enumValues>
  <enumValues>
    <name>Пользователи</name>
  </enumValues>
  <enumValues>
    <name>Заболевания</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/InformationRegisters/СинхронизацияКлассификаторовВЕТИС/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция СинхронизироватьНаСервере(ТипВЕТИС, ХозяйствующийСубъект, Предприятие)
	
	РазмерПорции = 500;
	
	Если ТипВЕТИС = Перечисления.ТипыВЕТИС.ВетеринарноСопроводительныеДокументы Тогда
		Изменения = ЗаявкиВЕТИСВызовСервера.ПодготовитьЗапросИзмененныхВетеринарноСопроводительныхДокументов(
			ХозяйствующийСубъект, Предприятие, РазмерПорции, УникальныйИдентификатор);
	ИначеЕсли ТипВЕТИС = Перечисления.ТипыВЕТИС.ЗаписиСкладскогоЖурнала Тогда
		Изменения = ЗаявкиВЕТИСВызовСервера.ПодготовитьЗапросИзмененныхЗаписейСкладскогоЖурнала(
			ХозяйствующийСубъект, Предприятие, РазмерПорции, УникальныйИдентификатор);
	Иначе
		ИнтеграцияВЕТИСВызовСервера.ВыполнитьСинхронизациюКлассификаторов(
			Неопределено,
			ТипВЕТИС);
	КонецЕсли;
	
	Возврат Изменения;
	
КонецФункции

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ТипВЕТИС) Тогда
		ПоказатьПредупреждение(, ИнтеграцияИСКлиентСервер.ТекстКомандаНеМожетБытьВыполнена());
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	РезультатОбмена = СинхронизироватьНаСервере(
		ТекущиеДанные.ТипВЕТИС,
		ТекущиеДанные.ХозяйствующийСубъект,
		ТекущиеДанные.Предприятие);
	
	Если РезультатОбмена <> Неопределено Тогда
		ОбработатьРезультатОбменаСВЕТИС(РезультатОбмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбменаСВЕТИС(РезультатОбмена)
	
	ИнтеграцияВЕТИСКлиент.ОбработатьРезультатОбмена(РезультатОбмена, ЭтотОбъект,, ОповещениеПриЗавершенииОбмена(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменОбработкаОжидания()
	
	ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект,, ОповещениеПриЗавершенииОбмена(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ОповещениеПриЗавершенииОбмена()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	
	Возврат ОписаниеОповещения;
	
КонецФункции

&НаКлиенте
Процедура ПослеПолученияРезультатОбработкиЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
